Tuya-Community/tuya-iotos-embeded-mcu-demo-wifi-ble-STM32_LORA_LCD_RECEIVE/STM32_LORA_LCD_RECEIVE/SPI_MASTER_476.si4project/Backup/main(6070).c
/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */
  uint8_t i=0;
  bool DetectTruetable[100]={0};//CAD成功的分布
  bool RXTruetable[100]={0};//CAD后能接收正确的分布
  uint8_t CadDetectedTime=0;//检测到的cad的次数
  uint8_t RxCorrectTime=0;//RX 接收正确次数
  uint8_t TxTime=0;		//TX 次数
  int random_number=0;
  RadioStatus_t RadioStatus;
  uint8_t L1_1st_gainstep=0;

	//连续发送的时候用
	uint8_t ModulationParam[8] = { 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };
    uint8_t PacketParam[9] = { 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_SPI1_Init();
  MX_USART2_UART_Init();

  /* USER CODE BEGIN 2 */

  for(i=0;i<1;i++)
  {
	HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
	HAL_Delay(1000);
	HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
	HAL_Delay(1000);
  }
  //HAL_Delay(2000);

  SX126xReset();
  //HAL_Delay(1000);
  i=SX126xReadRegister(REG_LR_CRCSEEDBASEADDR);
  if(i==0x1D)
  {   
	printf("SPI SUCCESS!\n\r");
  }
  else
  {
	printf("SPI Fail! REG_LR_CRCSEEDBASEADDR=%x\n\r",i);
  }
  //while(1);
  RadioInit();
  SX126xWriteRegister(0x889, SX126xReadRegister(0x889) & 0xfB);//SdCfg0 (0x889) sd_res (bit 2) = 0 
  printf("RadioInit Done!\n\r");


#if (TEST_MODE==0)   //infinite preamble TX mode
	//连续发送
	SX126xSetStandby( STDBY_RC );
	SX126xSetPacketType(PACKET_TYPE_LORA);//todo: 增加发射FSK模式下的改指令
	
	printf("set lora params\n");
	ModulationParam[0]=LORA_SPREADING_FACTOR;
	ModulationParam[1]=Bandwidths_copy[LORA_BANDWIDTH];
	ModulationParam[2]=LORA_CODINGRATE;
	ModulationParam[3]=0;//1:SF11 and SF12 0:其他 低速率优化  
	SX126xWriteCommand( RADIO_SET_MODULATIONPARAMS, ModulationParam, 4 );//lora发射参数配置


	//设置lora包参数
	PacketParam[0]=(LORA_PREAMBLE_LENGTH>>8)& 0xFF;
	PacketParam[1]=LORA_PREAMBLE_LENGTH;
	PacketParam[2]=LORA_FIX_LENGTH_PAYLOAD_ON;//head type
	PacketParam[3]=0xFF;//0Xff is MaxPayloadLength
	PacketParam[4]=true;//CRC on
	PacketParam[5]=LORA_IQ_INVERSION_ON;
	SX126xWriteCommand( RADIO_SET_PACKETPARAMS, PacketParam, 6 );

	//SX126xWriteBuffer( 0x00, SendData, 10 );

	//连续发送lora
	SX126xSetRfFrequency( RF_FREQUENCY );
    SX126xSetRfTxPower( TX_OUTPUT_POWER );
	SX126xSetTxInfinitePreamble();

	printf("TxContinuousWave Now--infinite preamble!\n\r");
	while(1);
#elif (TEST_MODE==1) //TX CW

	RadioSetTxContinuousWave( RF_FREQUENCY, TX_OUTPUT_POWER, TX_TIMEOUT );
	printf("TxContinuousWave Now---CW!\n\r");
	while(1);

#endif


#if (FSK_MODE==1)

	SX126xSetRfFrequency(RF_FREQUENCY);
	RadioSetTxConfig( MODEM_FSK, TX_OUTPUT_POWER, FSK_FDEV, 0,
						FSK_DATARATE, 0,
						FSK_PREAMBLE_LENGTH, FSK_FIX_LENGTH_PAYLOAD_ON,
						true, 0, 0, 0, 3000 );
	
	RadioSetRxConfig( MODEM_FSK, FSK_BANDWIDTH, FSK_DATARATE,
						0, FSK_AFC_BANDWIDTH, FSK_PREAMBLE_LENGTH,
						0, FSK_FIX_LENGTH_PAYLOAD_ON, 0, true,0, 0,false, RX_CONTINOUS );
	
	//printf("FSK:%d,Fdev=%ld,BitRate=%ld,BW=%ld,PWR=%d,PreLen=%d,PYLOAD=%d\n\r",RF_FREQUENCY,FSK_FDEV,FSK_DATARATE,FSK_BANDWIDTH,TX_OUTPUT_POWER,FSK_PREAMBLE_LENGTH,BUFFER_SIZE);
	printf("configure FSK parameters done\n!");

#elif (LORA_MODE==1)

			SX126xSetRfFrequency(RF_FREQUENCY);
			RadioSetTxConfig( MODEM_LORA, TX_OUTPUT_POWER, 0, LORA_BANDWIDTH,
									   LORA_SPREADING_FACTOR, LORA_CODINGRATE,
									   LORA_PREAMBLE_LENGTH, LORA_FIX_LENGTH_PAYLOAD_ON,
									   true, 0, 0, LORA_IQ_INVERSION_ON, 3000 );


		  RadioSetRxConfig( MODEM_LORA, LORA_BANDWIDTH, LORA_SPREADING_FACTOR,
										 LORA_CODINGRATE, 0, LORA_PREAMBLE_LENGTH,
										 LORA_SYMBOL_TIMEOUT, LORA_FIX_LENGTH_PAYLOAD_ON,
										 0, true, 0, 0, LORA_IQ_INVERSION_ON, RX_CONTINOUS );//最后一个参数设置是否是连续接收


		
		 printf("LORA:%d,SF=%d,codeRate=%d,BW=%d,PWR=%d,PreLen=%d,PYLOAD=%d\n\r",RF_FREQUENCY,LORA_SPREADING_FACTOR,LORA_CODINGRATE,LORA_BANDWIDTH,TX_OUTPUT_POWER,LORA_PREAMBLE_LENGTH,BUFFER_SIZE);
		// { true,false }--public,{ false,false }--private
		 if (RadioPublicNetwork.Previous==true && RadioPublicNetwork.Current==false)
			printf("public\n\r");
		 else if (RadioPublicNetwork.Previous==false && RadioPublicNetwork.Current==false)
			printf("private\n\r");
		printf("configure LORA parameters done\n!");
		 
		 		 
		 ///tx filter CPL=7
		//printf("before modification:reg0x745=0x%x\n",SX126xReadRegister(0x745));
		//SX126xWriteRegister(0x745, SX126xReadRegister(0x745) | 0x6);
		//printf("after modification:reg0x745=0x%x\n",SX126xReadRegister(0x745));

		 
		 
		 //timeout=0代表单次接收，但是会先判断是否是连续接收，这个优先级最高
		  //RadioRx(3000);//连续接收 只要在这里设置一次就可以  中间不能sleep 否则要重新执行RadioRx();
		  //printf("begin to RX--lora packets mode\n!");
#endif


	//SX126xSetRxTxFallbackMode(0x30);//退回到STANDBY_XOSC
	//printf("SX126xSetRxTxFallbackMode to STANDBY_XOSC\n!");
	
	//连续接收时使能这个
	 //while(1);



	/*	
  //ana_gain_mode=2
  SX126xWriteRegister(0xA, SX126xReadRegister(0xA) & 0xEF);//(bit 4) = 0 
  SX126xWriteRegister(0xA, SX126xReadRegister(0xA) | 0x20);//(bit 5) = 1 
  //gain_step_mc
  SX126xWriteRegister(0xA, SX126xReadRegister(0xA) & 0xFE);//(bit(3..0)) = 1111B 
  SX126xWriteRegister(0xA, SX126xReadRegister(0xA) | 0x01);//(bit(3..0)) = 1111B 
	*/
  

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

#if (TRANSMITTER==1)
	//printf("before modification:reg0x745=0x%x\n",SX126xReadRegister(0x745));
	//SX126xWriteRegister(0x745, SX126xReadRegister(0x745) | 0x7);
	//printf("after modification:reg0x745=0x%x\n",SX126xReadRegister(0x745));
		
	while(1)
	{
		Buffer[0] = TxTime++;
	    Buffer[1] = 0;
	    Buffer[2] = 0;
	    Buffer[3] = 0;
	    Buffer[4] = 0;
	    Buffer[5] = 0;
		RadioSend(Buffer,6);
		while(TXDone==false && TimeOutFlag==false);//一直等待tx done
		TXDone=false;
		TimeOutFlag=false;
		printf("TxTime=%d\n",TxTime);
		HAL_Delay(1000); ///1s

		//读取状态
		RadioStatus=SX126xGetStatus();
		printf("RadioStatus is(after TX_DONE) %d\n",(((RadioStatus.Value)>>4)&0x07));
		
		
