Tuya-Community/tuya-iotos-embeded-mcu-demo-wifi-ble-STM32_LORA_LCD_RECEIVE/STM32_LORA_LCD_RECEIVE/SPI_MASTER_476.si4project/Backup/main(6070).c
  /*Configure GPIO pin : DIO1_Pin */
  GPIO_InitStruct.Pin = DIO1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(DIO1_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : LED_Pin */
  GPIO_InitStruct.Pin = LED_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LED_GPIO_Port, &GPIO_InitStruct);

  /* EXTI interrupt init*/
  HAL_NVIC_SetPriority(EXTI4_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI4_IRQn);

  HAL_NVIC_SetPriority(EXTI15_10_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);

}

/* USER CODE BEGIN 4 */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{

	//printf("ISR mode=%d!\n",(uint8_t)SX126xGetOperatingMode());
	SX126xOnDio1Irq();

}
//DIO1的中断函数
void SX126xOnDio1Irq(void)
{
	 uint16_t irqRegs = SX126xGetIrqStatus( );
     SX126xClearIrqStatus( IRQ_RADIO_ALL );//这里清掉中断标志
     //发送结束
	 if( ( irqRegs & IRQ_TX_DONE ) == IRQ_TX_DONE )
        {
// 			TimerStop( &TxTimeoutTimer );
//          if( ( RadioEvents != NULL ) && ( RadioEvents->TxDone != NULL ) )
//          {
//               RadioEvents->TxDone( );
//          }
		   TXDone=true;
		   HAL_GPIO_TogglePin(LED_GPIO_Port,LED_Pin);
		   OnTxDone();
			
        }

		//在SX126xSetTx()设置了一个超时时间 可以检测改功能 --ok
 		if( ( irqRegs & IRQ_RX_TX_TIMEOUT ) == IRQ_RX_TX_TIMEOUT )
        {
// 			TimerStop( &TxTimeoutTimer );
//          if( ( RadioEvents != NULL ) && ( RadioEvents->TxDone != NULL ) )
//          {
//               RadioEvents->TxDone( );
//          }
		   TimeOutFlag=true;
		   printf(" RX/TX timeout\n");
			
        }


        

        if( ( irqRegs & IRQ_RX_DONE ) == IRQ_RX_DONE )
        {
            

            //TimerStop( &RxTimeoutTimer );
            SX126xGetPayload( RadioRxPayload, &RadioRxPacketSize , 255 );
            SX126xGetPacketStatus( &RadioPktStatus );
//            if( ( RadioEvents != NULL ) && ( RadioEvents->RxDone != NULL ) )
//            {

				HAL_GPIO_TogglePin(LED_GPIO_Port,LED_Pin);
                OnRxDone();
                RXDoneFlag=true;
//            }
      }

        if( ( irqRegs & IRQ_CRC_ERROR ) == IRQ_CRC_ERROR )
        {
            //if( ( RadioEvents != NULL ) && ( RadioEvents->RxError ) )
            //{
                //RadioEvents->RxError( );
                printf("CRC fail\n");
                CRCFail=true;
            //}
        }

        if( ( irqRegs & IRQ_CAD_DONE ) == IRQ_CAD_DONE )
        {
//            if( ( RadioEvents != NULL ) && ( RadioEvents->CadDone != NULL ) )
//            {
//               RadioEvents->CadDone( ( ( irqRegs & IRQ_CAD_ACTIVITY_DETECTED ) == IRQ_CAD_ACTIVITY_DETECTED ) );
//            }
//			printf("IRQ_CAD_DONE\n");
//			CadDone=true;
			if ( ( irqRegs & IRQ_CAD_ACTIVITY_DETECTED ) == IRQ_CAD_ACTIVITY_DETECTED ) 
			{
//				printf("IRQ_CAD_ACTIVITY_DETECTED\n");	
//				CadDetect=true;
			}
//            
        }

//        if( ( irqRegs & IRQ_RX_TX_TIMEOUT ) == IRQ_RX_TX_TIMEOUT )
//        {
//            if( SX126xGetOperatingMode( ) == MODE_TX )
//            {
//                TimerStop( &TxTimeoutTimer );
//                if( ( RadioEvents != NULL ) && ( RadioEvents->TxTimeout != NULL ) )
//                {
//                    RadioEvents->TxTimeout( );
//                }
//            }
//            else if( SX126xGetOperatingMode( ) == MODE_RX )
//            {
//                TimerStop( &RxTimeoutTimer );
//                if( ( RadioEvents != NULL ) && ( RadioEvents->RxTimeout != NULL ) )
//                {
//                    RadioEvents->RxTimeout( );
//                }
//            }
//        }

        if( ( irqRegs & IRQ_PREAMBLE_DETECTED ) == IRQ_PREAMBLE_DETECTED )
        {
            __NOP( );
        }

        if( ( irqRegs & IRQ_SYNCWORD_VALID ) == IRQ_SYNCWORD_VALID )
        {
            __NOP( );
        }

        if( ( irqRegs & IRQ_HEADER_VALID ) == IRQ_HEADER_VALID )
        {
            __NOP( );
        }

//        if( ( irqRegs & IRQ_HEADER_ERROR ) == IRQ_HEADER_ERROR )
//        {
//            TimerStop( &RxTimeoutTimer );
//            if( ( RadioEvents != NULL ) && ( RadioEvents->RxTimeout != NULL ) )
//            {
//                RadioEvents->RxTimeout( );
//            }
//        }
    
}
//产生触发脉冲
void GenTrig(void)
{
	HAL_GPIO_WritePin(TrigIO_GPIO_Port,TrigIO_Pin,GPIO_PIN_SET);
	
	HAL_GPIO_WritePin(TrigIO_GPIO_Port,TrigIO_Pin,GPIO_PIN_RESET);

	
}

void OnTxDone(void)
{
	SleepParams_t params = { 0 };

    params.Fields.WarmStart = 1;//热启动
    //printf("params.value=%d\n",params.Value);
    //SX126xSetSleep( params );//热启动可以保存进入睡眠前的状态的相关寄存器  sleep可以清掉所有中断标志位
	printf("OnTxDone\n");

}
void OnRxDone()
{

	int i;
	
	printf("onRXDone\n");
    SleepParams_t params = { 0 };

    params.Fields.WarmStart = 1;//热启动

//	printf("before sleep,operate mode=%d\n",SX126xGetOperatingMode());

  //  SX126xSetSleep( params );//

//	printf("after sleep,operate mode=%d\n",SX126xGetOperatingMode());
    //BufferSize = size;

	//TODO:处理包的数据
	
	

	
	printf("PacketSIZE=%d,RSSI=%d,SNR=%d\n",
			RadioRxPacketSize,
					RadioPktStatus.Params.LoRa.RssiPkt, 
							RadioPktStatus.Params.LoRa.SnrPkt);

	printf("Payload: ");
	for(i=0;i<RadioRxPacketSize;i++)
	{
		printf("0x%x ",RadioRxPayload[i]);
	}

	//for(k=0;k<RadioRxPacketSize;k++)
    //	printf("%d ",RadioRxPayload[k]);
    //printf("RX OK=%d\n",++Cnt1);
    //RssiValue = rssi;
    //SnrValue = snr;
   // State = RX;
}


/*******************************************************************************
函数名称：fputc(int ch, FILE *f)
功    能：串口实现Printf()函数功能
参    数：无
返回值  ：
********************************************************************************/

int fputc(int ch, FILE *f)
{
      //USART_SendData(USART1, (unsigned char) ch);
      HAL_UART_Transmit(&huart2, (uint8_t *)&ch, 1, 20);
	  while(HAL_UART_GetState(&huart2)==HAL_UART_STATE_RESET);
      return (ch);
}




/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
